#  تابعی بنویسید برای کنترل سرعت خودرو: این تابع یک آرگومان میگیرد که نمایانگر سرعت است. 
#اگر سرعت کمتر از 70 باشد مقادر "good" 
# . در غیر اینصورت به ازای هر 5 کیلومتر سرعت بیشتر از مقدار مجاز 70 یک امتیاز منفی به راننده می دهد و در آخر مجموع میزان امتیاز منفی را خروجی می دهد
#  اگر سرعت 80 باشد امتیاز منفی 2 را خروجی می دهد. و 
# اگر یک راننده بیشتر از 12 امتیاز منفی داشته باشد گواهینامه راننده باطل شده و تابع پیام "گواهینامه شما باطل شد" را پرینت می گیرد



def speed_test(speed):
    if speed < 70 :
        return print('Good')
    elif speed > 70:

        for score in range(1 , 31 , 5):
            score += 1
            return print(score)     
    
    if score >= 12:
        return print( 'Your license is expired' )



speed_test(90)